app/Controllers/LoginController.php

SELECT *
FROM `users`
WHERE `user_login` = 'Jubis2004'
 LIMIT 1
---
    public function auth(){
        $post = $this->request->getPost();

        if (empty($post['user_login']) || empty($post['user_password'])) {
            return redirect()->back()->with('error', 'Preencha login e senha.')->withInput();
        }

        $user = $this->userModel->where('user_login', $post['user_login'])->first();