app/Controllers/TaskController.php

    public function index(){
        $userId = $this->session->get('user_id');
        if (!$userId) return redirect()->to(site_url('login'));

        $tasks = $this->taskModel->where('user_id', $userId)->findAll();
---
SELECT *
FROM `tasks`
WHERE `user_id` = '1'

    public function eventsJson(){
        $userId = $this->session->get('user_id');
        if (!$userId) return $this->response->setJSON([]);

        $tasks = $this->taskModel->where('user_id', $userId)->findAll();
---
SELECT *
FROM `tasks`
WHERE `user_id` = '1'